In [1]:
#imports
import pandas as pd
import numpy as np

In [2]:
#assign data to variables
title_basics_url = "https://datasets.imdbws.com/title.basics.tsv.gz"
title_akas_url = "https://datasets.imdbws.com/title.akas.tsv.gz"
title_ratings_url = "https://datasets.imdbws.com/title.ratings.tsv.gz"

In [19]:
#read variable to dataframe
basics = pd.read_csv(title_basics_url,sep='\t', low_memory=False)

In [4]:
#read variable to dataframe
akas = pd.read_csv(title_akas_url,sep='\t', low_memory=False)

In [5]:
#read variable to dataframe
ratings = pd.read_csv(title_ratings_url,sep='\t', low_memory=False)

In [20]:
#view basics df
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [21]:
#view datatypes of basics df
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9151875 entries, 0 to 9151874
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 628.4+ MB

In [22]:
#replace \n with NaN
basics = basics.replace({'\\N':np.nan})
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,NaN,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,NaN,1,"Comedy,Short"

In [23]:
#change basics.startYear data type to float
basics['startYear']  = basics['startYear'].astype('float')

In [24]:
#view datatypes of basics df to confirm startYear changed to float
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9151875 entries, 0 to 9151874
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       float64
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: float64(1), object(8)
memory usage: 628.4+ MB

In [25]:
#use value_counts to view unique values for startYear
basics.value_counts('startYear')

startYear
2021.0    423784
2018.0    419722
2017.0    416985
2019.0    407142
2016.0    395868
           ...
1881.0         2
1878.0         2
1885.0         1
1883.0         1
1874.0         1
Length: 150, dtype: int64

In [26]:
#run value_counts on titleType to see spelling of values 
basics.value_counts('titleType')

titleType
tvEpisode       6892357
short            884539
movie            618658
video            264256
tvSeries         229666
tvMovie          137199
tvMiniSeries      44722
tvSpecial         37980
videoGame         31863
tvShort           10633
tvPilot               2
dtype: int64

In [13]:
#replace \n with NaN
akas = akas.replace({'\\N':np.nan})
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,imdbDisplay,NaN,0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0
3,tt0000001,4,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0
4,tt0000001,5,Карменсита,RU,NaN,imdbDisplay,NaN,0

In [14]:
#replace \n with NaN
ratings = ratings.replace({'\\N':np.nan})
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.9       256
2  tt0000003            6.5      1702
3  tt0000004            5.7       168
4  tt0000005            6.2      2517

In [27]:
#filter basics df where 'runtimeMinutes' does not equal NaN
basics = basics[basics['runtimeMinutes'] != 'NaN'] 
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894.0,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892.0,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892.0,NaN,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892.0,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893.0,NaN,1,"Comedy,Short"

In [28]:
#filter basics df where 'genres'' does not equal NaN
basics = basics[basics['genres'] != 'NaN'] 
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894.0,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892.0,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892.0,NaN,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892.0,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893.0,NaN,1,"Comedy,Short"

In [29]:
#filter basics df where 'titleType'' equals 'movie'
basics = basics[basics['titleType'] == 'movie'] 
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
8,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894.0,NaN,45,Romance
498,tt0000502,movie,Bohemios,Bohemios,0,1905.0,NaN,100,NaN
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906.0,NaN,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907.0,NaN,90,Drama
610,tt0000615,movie,Robbery Under Arms,Robbery Under Arms,0,1907.0,NaN,NaN,Drama

In [33]:
#filter basics where startYear equals 2000 or 2001
basics = basics[(basics['startYear'] == 2000.0 ) | (basics['startYear'] == 2001.0 )]
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
15174,tt0015414,movie,La tierra de los toros,La tierra de los toros,0,2000.0,NaN,60,NaN
34790,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
77928,tt0079644,movie,November 1828,November 1828,0,2001.0,NaN,140,"Drama,War"
87077,tt0089067,movie,El día de los albañiles 2,El día de los albañiles 2,0,2001.0,NaN,90,Comedy
100037,tt0102362,movie,Istota,Istota,0,2000.0,NaN,80,"Drama,Romance"

In [34]:
#use value_counts funtion to view unique naming conventions to determine US
akas.value_counts('region')

region
FR    3922819
JP    3922398
DE    3905831
IN    3850455
ES    3846016
       ...
PW          1
NR          1
TC          1
TV          1
NU          1
Length: 246, dtype: int64

In [35]:
#filter akas to region eques US only
akas = akas[akas['region'] == 'US'] 
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
14,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
36,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
41,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0

In [36]:
#filter basics df where genre contains "Documentary"
basics = basics[basics['genres'].str.contains("Documentary")==True]
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
115376,tt0118154,movie,White Hotel,White Hotel,0,2001.0,NaN,90,"Biography,Documentary"
117564,tt0120454,movie,Vinyl,Vinyl,0,2000.0,NaN,110,Documentary
118523,tt0121609,movie,On Parole,On Parole,0,2001.0,NaN,NaN,Documentary
126852,tt0130458,movie,Anikó,Anikó,0,2000.0,NaN,70,Documentary
133251,tt0137210,movie,Siestas & Olas: A Surfing Journey Through Mexico,Siestas & Olas: A Surfing Journey Through Mexico,0,2000.0,NaN,87,"Documentary,Sport"

In [37]:
# Filter the basics table down to only include the US by using the filter akas dataframe
keepers =basics['tconst'].isin(akas['titleId'])
keepers

115376      True
117564      True
118523      True
126852     False
133251      True
           ...
9076928    False
9082393    False
9092766     True
9101474    False
9132654    False
Name: tconst, Length: 2214, dtype: bool

In [38]:
#filter basics on the "keepers"
basics = basics[keepers]
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
115376,tt0118154,movie,White Hotel,White Hotel,0,2001.0,NaN,90,"Biography,Documentary"
117564,tt0120454,movie,Vinyl,Vinyl,0,2000.0,NaN,110,Documentary
118523,tt0121609,movie,On Parole,On Parole,0,2001.0,NaN,NaN,Documentary
133251,tt0137210,movie,Siestas & Olas: A Surfing Journey Through Mexico,Siestas & Olas: A Surfing Journey Through Mexico,0,2000.0,NaN,87,"Documentary,Sport"
139529,tt0143861,movie,Scratch,Scratch,0,2001.0,NaN,92,"Documentary,Music"
...,...,...,...,...,...,...,...,...,...
8838750,tt9242918,movie,Great White Shark: Truth Behind the Legend,Great White Shark: Truth Behind the Legend,0,2000.0,NaN,75,Documentary
8923194,tt9424390,movie,Tangled Roots,Tangled Roots,0,2001.0,NaN,64,Documentary
8983587,tt9555134,movie,9/11,9/11,0,2001.0,NaN,45,Documentary
9036347,tt9668554,movie,Armageddon: Bible Prophecies and the Predictio...,Armageddon: Bible Prophecies and the Predictio...,0,2001.0,NaN,60,Documentary
9092766,tt9789230,movie,Girls Who Like Girls,Girls Who Like Girls,0,2001.0,NaN,89,"Documentary,History"

In [39]:
# show summary of how many movies remain and feature datatypes 
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 768 entries, 115376 to 9092766
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          768 non-null    object
 1   titleType       768 non-null    object
 2   primaryTitle    768 non-null    object
 3   originalTitle   768 non-null    object
 4   isAdult         768 non-null    object
 5   startYear       768 non-null    float64
 6   endYear         0 non-null      object
 7   runtimeMinutes  660 non-null    object
 8   genres          768 non-null    object
dtypes: float64(1), object(8)
memory usage: 60.0+ KB

In [40]:
# show summary of how many movies remain and feature datatypes 
akas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1342706 entries, 5 to 32863389
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1342706 non-null  object
 1   ordering         1342706 non-null  int64
 2   title            1342706 non-null  object
 3   region           1342706 non-null  object
 4   language         3681 non-null     object
 5   types            963269 non-null   object
 6   attributes       44738 non-null    object
 7   isOriginalTitle  1341331 non-null  object
dtypes: int64(1), object(7)
memory usage: 92.2+ MB

In [41]:
# show summary of how many movies remain and feature datatypes 
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1263317 entries, 0 to 1263316
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1263317 non-null  object
 1   averageRating  1263317 non-null  float64
 2   numVotes       1263317 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.9+ MB

In [42]:
# example making new folder with os
import os
os.makedirs('Data/',exist_ok=True) 
# Confirm folder created
os.listdir("Data/")

['title_akas.csv.gz', 'title_basics.csv.gz', 'title_ratings.csv.gz']

In [43]:
## Save current dataframe to file.
basics.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)

In [44]:
# Open saved file and preview again
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0118154,movie,White Hotel,White Hotel,0,2001.0,NaN,90.0,"Biography,Documentary"
1,tt0120454,movie,Vinyl,Vinyl,0,2000.0,NaN,110.0,Documentary
2,tt0121609,movie,On Parole,On Parole,0,2001.0,NaN,NaN,Documentary
3,tt0137210,movie,Siestas & Olas: A Surfing Journey Through Mexico,Siestas & Olas: A Surfing Journey Through Mexico,0,2000.0,NaN,87.0,"Documentary,Sport"
4,tt0143861,movie,Scratch,Scratch,0,2001.0,NaN,92.0,"Documentary,Music"

In [45]:
## Save current dataframe to file.
akas.to_csv("Data/title_akas.csv.gz",compression='gzip',index=False)

In [46]:
# Open saved file and preview again
akas = pd.read_csv("Data/title_akas.csv.gz", low_memory = False)
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [47]:
## Save current dataframe to file.
ratings.to_csv("Data/title_ratings.csv.gz",compression='gzip',index=False)

In [48]:
# Open saved file and preview again
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.9       256
2  tt0000003            6.5      1702
3  tt0000004            5.7       168
4  tt0000005            6.2      2517